app/controllers/products_controller.rb

INSERT INTO "products" ("nome", "acessorio", "material", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "FOI"], ["acessorio", "FOI"], ["material", "FOI"], ["created_at", "2021-03-17 14:05:32.271053"], ["updated_at", "2021-03-17 14:05:32.271053"]]
---
  def edit
    @product.icon.attach(params[:icon])

SELECT "products".* FROM "products"
---
  def brincosPrata
    @products = Product.all

SELECT "products".* FROM "products"
---
  def brincosOuro
    @products = Product.all

SELECT "products".* FROM "products"
---
  def aneisPrata
    @products = Product.all

SELECT "products".* FROM "products"
---
  def aneisOuro
    @products = Product.all

INSERT INTO "products" ("nome", "acessorio", "material", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "1"], ["acessorio", "Brinco"], ["material", "Ouro"], ["price", 45.0], ["created_at", "2021-03-17 20:52:01.462232"], ["updated_at", "2021-03-17 20:52:01.462232"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "updated_at" = ?, "quero" = ?, "destaque" = ? WHERE "products"."id" = ?  [["updated_at", "2021-03-18 16:07:11.013721"], ["quero", 1], ["destaque", 1], ["id", 22]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 15]]
---
  def destroy # DELETE request /users/:id
    @product = Product.find(params[:id])

    @product.destroy