app/controllers/products_controller.rb

UPDATE "products" SET "nome" = ?, "acessorio" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["nome", "Foi"], ["acessorio", "Foi"], ["updated_at", "2021-03-17 14:00:41.441957"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)